In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[-2.47379832,  0.44036906, -0.64249854],
       [ 0.77290211, -0.70391369,  0.53598838],
       [-1.55801267, -0.71509671, -0.36154835],
       [ 1.57100891,  2.11476948,  0.02360962]])

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

          0         1         2
0 -2.473798  0.440369 -0.642499
1  0.772902 -0.703914  0.535988
2 -1.558013 -0.715097 -0.361548
3  1.571009  2.114769  0.023610

In [7]:
type(data_frame)

pandas.core.frame.DataFrame

In [8]:
data_frame[0]

0   -2.473798
1    0.772902
2   -1.558013
3    1.571009
Name: 0, dtype: float64

In [9]:
type(data_frame[0])

pandas.core.series.Series

In [10]:
new_df = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Salary","Age","Seniority"])

In [11]:
new_df

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [12]:
new_df["Age"]

Atil      0.440369
Zeynep   -0.703914
Atlas    -0.715097
Mehmet    2.114769
Name: Age, dtype: float64

In [13]:
new_df[["Age","Salary"]]

             Age    Salary
Atil    0.440369 -2.473798
Zeynep -0.703914  0.772902
Atlas  -0.715097 -1.558013
Mehmet  2.114769  1.571009

In [14]:
#satır yani row için ise loc metodunu kullanırız.

In [15]:
new_df.loc["Atil"]

Salary      -2.473798
Age          0.440369
Seniority   -0.642499
Name: Atil, dtype: float64

In [16]:
new_df.iloc[0]

Salary      -2.473798
Age          0.440369
Seniority   -0.642499
Name: Atil, dtype: float64

In [17]:
# iloc aslında şu demek, locationu indekse göre locate etmek.

In [18]:
data_frame[0]

0   -2.473798
1    0.772902
2   -1.558013
3    1.571009
Name: 0, dtype: float64

In [19]:
##data manipulation

In [24]:
new_df["extra"] = 10 ## bu şekilde hepsine 10 atar

In [22]:
new_df

          Salary       Age  Seniority  extra
Atil   -2.473798  0.440369  -0.642499     10
Zeynep  0.772902 -0.703914   0.535988     10
Atlas  -1.558013 -0.715097  -0.361548     10
Mehmet  1.571009  2.114769   0.023610     10

In [26]:
new_df.drop("extra",axis = 1)

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [27]:
#axis 1 belirtmek şudur, 1 sütunlar (columnlar) 0 ise rowlardır.

In [29]:
#extra diye row olursa onu da sşilmesin sadece columnları da silsin diye dedik

In [30]:
#new_df değişmeis için new_df = new_df.drop("extra",axis = 1) yapabişiriz

In [31]:
#ya da

In [33]:
new_df.drop("extra", axis=1, inplace=True)
#inplace gercekten bunu icinde yap demektir

In [34]:
new_df

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [35]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548

In [36]:
new_df

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [37]:
#axisin default değeri sıfırdır.belirtmezsek rowu siler.

In [38]:
new_df.loc["Atlas"]

Salary      -1.558013
Age         -0.715097
Seniority   -0.361548
Name: Atlas, dtype: float64

In [39]:
new_df.loc["Atlas"]["Salary"]

np.float64(-1.558012667991669)

In [41]:
# ya da 
new_df.loc["Atlas","Salary"]

np.float64(-1.558012667991669)

In [42]:
new_df

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [44]:
boolean_frame = new_df > 0

In [45]:
boolean_frame

        Salary    Age  Seniority
Atil     False   True      False
Zeynep    True  False       True
Atlas    False  False      False
Mehmet    True   True       True

In [46]:
new_df[boolean_frame]

          Salary       Age  Seniority
Atil         NaN  0.440369        NaN
Zeynep  0.772902       NaN   0.535988
Atlas        NaN       NaN        NaN
Mehmet  1.571009  2.114769   0.023610

In [47]:
new_df[new_df > 0]

          Salary       Age  Seniority
Atil         NaN  0.440369        NaN
Zeynep  0.772902       NaN   0.535988
Atlas        NaN       NaN        NaN
Mehmet  1.571009  2.114769   0.023610

In [51]:
new_df[new_df["Salary"] > 1]

          Salary       Age  Seniority
Mehmet  1.571009  2.114769    0.02361

In [52]:
new_df[new_df["Age"] > 0.5]

          Salary       Age  Seniority
Mehmet  1.571009  2.114769    0.02361

In [53]:
new_df

          Salary       Age  Seniority
Atil   -2.473798  0.440369  -0.642499
Zeynep  0.772902 -0.703914   0.535988
Atlas  -1.558013 -0.715097  -0.361548
Mehmet  1.571009  2.114769   0.023610

In [54]:
##indeks işlemleri

In [57]:
new_df.reset_index() #bu şekilde indeks diye column açar ama asıl indeksler soldadır

    index    Salary       Age  Seniority
0    Atil -2.473798  0.440369  -0.642499
1  Zeynep  0.772902 -0.703914   0.535988
2   Atlas -1.558013 -0.715097  -0.361548
3  Mehmet  1.571009  2.114769   0.023610

In [56]:
new_indices = ["Ati", "Zey", "Atl", "Meh"]

In [58]:
new_df["NewIndex"] = new_indices

In [59]:
new_df

          Salary       Age  Seniority NewIndex
Atil   -2.473798  0.440369  -0.642499      Ati
Zeynep  0.772902 -0.703914   0.535988      Zey
Atlas  -1.558013 -0.715097  -0.361548      Atl
Mehmet  1.571009  2.114769   0.023610      Meh

In [60]:
#ama değiştirmemiş resetleyince tabi
reset_frame = new_df.reset_index()

In [62]:
reset_frame

    index    Salary       Age  Seniority NewIndex
0    Atil -2.473798  0.440369  -0.642499      Ati
1  Zeynep  0.772902 -0.703914   0.535988      Zey
2   Atlas -1.558013 -0.715097  -0.361548      Atl
3  Mehmet  1.571009  2.114769   0.023610      Meh

In [66]:
new_df.set_index("NewIndex",inplace = True)

In [67]:
new_df

            Salary       Age  Seniority
NewIndex
Ati      -2.473798  0.440369  -0.642499
Zey       0.772902 -0.703914   0.535988
Atl      -1.558013 -0.715097  -0.361548
Meh       1.571009  2.114769   0.023610

In [68]:
new_df.loc["Ati"]

Salary      -2.473798
Age          0.440369
Seniority   -0.642499
Name: Ati, dtype: float64

In [70]:
#multi index

In [71]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [72]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [73]:
zipped_index = list(zip(first_index,inner_index))

In [74]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [75]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [76]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [77]:
sample_values = np.ones((6,2))

In [78]:
sample_values

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [79]:
big_df = pd.DataFrame(data = sample_values, index=zipped_index, columns=["Age", "Salary"])

In [80]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [81]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [82]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [83]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64